{

    "stress": [
        [
            "As if *one* penalty wasn't enough.",
            "Why do you people *want* to be fined?",
            "Is this fun? Do you enjoy this somehow?",
            "Oh no, not you too!",
            "Troublemakers...",
            "Oh, come *on!*",
            "If you're not careful, you'll start a howling."
        ],
        [
            "You folk need to seek awoo rehabilitation.",
            "Stop, in the name of the law!",
            "Look, I don't actually care if you keep going. I get a cut from all of this.",
            "Okay, now you're doing this on purpose.",
            "Let's hope this is in the spam channel."
        ],
        [
            "Alright, this... is now a little too extreme.",
            "How has the spam filter not kicked in yet?",
            "You people are insane."
        ]
    ],

    "silence": [
        "FYI I'm still keeping track.",
        "Just because I'm not saying anything doesn't mean I'm not fining you.",
        "Go ahead. Keep going. It's your money.",
        "Don't think you're off the hook just because I'm quiet.",
        "Still going? Whatever, it's your money.",
        "Your money will be put towards a better cause.",
        "You're not above the law.",
        "Now you're just doing this on purpose, aren't you?",
        "You're just trying to get on my nerves, aren't you?"
    ],

    "bypass": [
        "Oh, you think you're really clever don't you?",
        "It's going to take more than that to fool me.",
        "You're a tricky one. I admire your moxie.",
        "Sorry bud, but I've seen it all.",
        "Oldest trick in the book.",
        "Think I can't see past your little tricks?",
        "It was a good attempt. I almost didn't catch that. *Almost*.",
        "Clever, but not clever enough!",
        "I don't see that alternative very often.",
        "I'll admit it was a good attempt, but the law is the law.",
        "You can't deceive me *that* easily!",
        "Oh please, that one was obvious.",
        "Nice try.",
        "Didn't think I'd notice, huh? Think again.",
        "It was a good attempt, I'll give you that."
    ],

    "legalize": [
        "Sorry, I'm just a grunt. Tell that to the higher-ups.",
        "The law is the law. I'm just here to enforce it.",
        "Hey, I'm not the guy that makes the rules, alright?",
        "File a formal complaint. Debate isn't my job.",
        "Sorry. The law is the law.",
        "Yeah sure, contact your local representative and all that."
    ]

}
