{
    "order": ["About", "General usage", "Advanced usage", "Filtering and spam control"],
    "entries": {
        "About": "This plugin allows users to create text and sound macros, known as tags. If you have used pretty much any other bot, you may already know about this common feature.\n\nIf you don't know about tags, the basic premise is simple. Create a tag with a specific name and a specific entry of text, and later on recall it by using the tag name. It's like creating a custom definition for a word or phrase. To see more about tags and how to use them, see the manual entry for \"General usage\".",
        "General usage": "Using tags is pretty easy. To create a tag, you can use the basic syntax `{invoker}tag create <\"tag name\"> <tag text>`.\nAs an example, `{invoker}tag create \"my tag\" This is the tag's text.` will create a tag called \"my tag\". To recall the text, simply type in `{invoker}tag my tag`, and the bot will respond with `This is the tag's text.`. It's as simple as that! Create memes, notices, tutorials, announcements, copypastas, etc. with a simple command.\n\nYou can also have special tags (such as random, sound, private, NSFW, or even a combination of them).\nAs an example, `{invoker}tag create rip random sound https://my.mixtape.moe/oxqwwi.mp3 https://my.mixtape.moe/wxtozw.mp3 https://my.mixtape.moe/byzeqd.mp3 https://my.mixtape.moe/pcrqal.mp3` will create a tag that will produce one of the random sounds in the voice channel you are in when called. By the way, mixtape.moe links will work faster with the bot! For more information on these extra options, see the manual page for \"Advanced usage\".\n\nTo remove a tag that you own, type `{invoker}tag remove <tag name>`.\n\nIf you want to find a specific tag without having to `{invoker}tag list`, you can search for a name with `{invoker}tag search <name>`.\n\nTags come with a few limitations, though. You cannot create a tag name that starts with a keyword (such as 'nsfw', or 'random') due to the potential confusion it can cause (imagine being able to do this: `{invoker}tag create create create`). Furthermore, sound tags cannot be longer than 30 seconds long by default (configurable by the bot owner). Lastly, each server can have a maximum of 500 tags by default (also configurable by the bot owner).\n\nFor help on individual commands, use the `{invoker}help tag` command. Also, editing commands will time out after a default of 2 minutes (once again, configurable by the bot owners).",
        "Advanced usage": "To get a grip on the other features of tags, you should consider reading `{invoker}help tag` and related commands if you haven't already.\n\nTags can have multiple properties. They can be random, private, or NSFW, or any combination. To check the properties of a tag, see `{invoker}tag info <tag name>`. There are two ways of setting these properties: at creation, and editing.\n\nTo create a tag with special attributes, add a valid property option at creation. For example, this is how you would create a private sound tag: `{invoker}tag create \"secret noises\" private sound https://my.mixtape.moe/ucgxzo.mp3`\n\nTo edit an existing tag to add attributes, use `{invoker}tag edit [edit options]`. For example, this is how you would make a tag NSFW: `{invoker}tag edit \"naughty tag\" nsfw`.\n\nTo see the available property options for `[options]` and `[edit options]`, check `{invoker}help tag`. They may be changed in the future, which is why they are not listed here.\n\nIt is also important to know that these properties are also available to be used as filters for tag listing. For example, to see all sound tags in a server, use `{invoker}tag list sound`.\n\nThere are a few notes to make on editing tags. Firstly, there is no way to convert a text tag to a sound tag or vice versa. Secondly, if you add an entry to a non-random tag, you will make it random. Similarly, removing all entries but one will convert the tag so that it is not random. If you remove all entries, it mimics the behavior of `{invoker}tag remove <tag name>`. Thirdly, you cannot set the text of a tag while also adding or removing an entry, or if the tag is random. Lastly, the volume can only be between 10% and 200%",
        "Filtering and spam control": "Note: this section is really only for bot moderators looking to control tag usage on a server.\n\nIf you want to keep some channels clean of tags, you can use the `{invoker}toggle <type> <channel name>` command.\nFor example, if you wanted to mute all sound tags in the hypothetical voice channel 'My Voice Channel', type `{invoker}tag toggle all My Voice Channel`. Note that using an ID or mention works too. If you wanted to do the same thing but only for NSFW tags, type the same command but replace 'all' with 'nsfw' (those are the only two mute types as of right now).\n\nThat's basically how to selectively mute and unmute tags in certain channels. There are some things to consider, though. If tags are disabled in a text channel, users will be unable to call blocked sound tags from that text channel. This means that if you block NSFW tags in a text channel, no NSFW tags can be used in that channel at all, even if it is a sound tag.\n\nSometimes there is only one user that is misusing tags. In this case, there is no way to prevent that user from *only* using tags - you will need to block that user from bot interaction as a whole. See `{invoker}manual 5` and `{invoker}help mod block` for that.\n\nLastly, as a bot moderator, you can modify other people's tags. This can really only be used in a responsible fashion if you are editing a sound tag that is too loud or too quiet. To do this, use `{invoker}tag edit <tag name> volume <new volume>`."
    }
}
